rongshuxia/rt-thread_stm32f407/board/ATK_MC2640/atk_mc2640.c
/**
 ****************************************************************************************************
 * @file        atk_mc2640.c
 * @author      ����ԭ���Ŷ�(ALIENTEK)
 * @version     V1.0
 * @date        2022-06-21
 * @brief       ATK-MC2640ģ����������
 * @license     Copyright (c) 2020-2032, �������������ӿƼ����޹�˾
 ****************************************************************************************************
 * @attention
 *
 * ʵ��ƽ̨:����ԭ�� ̽���� F407������
 * ������Ƶ:www.yuanzige.com
 * ������̳:www.openedv.com
 * ��˾��ַ:www.alientek.com
 * �����ַ:openedv.taobao.com
 *
 ****************************************************************************************************
 */

#include "atk_mc2640.h"
#include "atk_mc2640_sccb.h"
#include "atk_mc2640_cfg.h"
#include "stm32f4xx_hal.h"
#include "stm32f4_delay.h"

#if (ATK_MC2640_USING_DCMI == 0)
//#include "./MALLOC/malloc.h"
#endif

#if (ATK_MC2640_USING_DCMI != 0)
#include "atk_mc2640_dcmi.h"
#endif

/* ATK-MC2640ģ��������ID�Ͳ�ƷID */
#define ATK_MC2640_MID  0x7FA2
#define ATK_MC2640_PID  0x2642

/* ATK-MC2640�Ĵ�����ö�� */
typedef enum
{
    ATK_MC2640_REG_BANK_DSP = 0x00, /* DSP�Ĵ����� */
    ATK_MC2640_REG_BANK_SENSOR,     /* Sensor�Ĵ����� */
} atk_mc2640_reg_bank_t;

/* ATK-MC2640ģ�����ݽṹ�� */
static struct
{
    struct {
        uint16_t width;
        uint16_t height;
    } output;
    
#if (ATK_MC2640_USING_DCMI == 0)
    struct {
        uint8_t *line_buf;
        DMA_HandleTypeDef dma_handle;
    } read;
#endif
} g_atk_mc2640_sta = {0};

/**
 * @brief       ATK-MC2640ģ��д�Ĵ���
 * @param       reg: �Ĵ�����ַ
 *              dat: ��д���ֵ
 * @retval      ��
 */
static void atk_mc2640_write_reg(uint8_t reg, uint8_t dat)
{
    atk_mc2640_sccb_3_phase_write(ATK_MC2640_SCCB_ADDR, reg, dat);
}

/**
 * @brief       ATK-MC2640ģ����Ĵ���
 * @param       reg: �Ĵ����ĵ�ַ
 * @retval      ��ȡ���ļĴ���ֵ
 */
static uint8_t atk_mc2640_read_reg(uint8_t reg)
{
    uint8_t dat = 0;
    
    atk_mc2640_sccb_2_phase_write(ATK_MC2640_SCCB_ADDR, reg);
    atk_mc2640_sccb_2_phase_read(ATK_MC2640_SCCB_ADDR, &dat);
    
    return dat;
}

/**
 * @brief       ����ATK-MC2640ģ�����õļĴ�����
 * @param       set: ATK_MC2640_REG_BANK_DSP   : DSP�Ĵ�����
 *                   ATK_MC2640_REG_BANK_SENSOR: Sensor�Ĵ�����
 * @retval      ATK_MC2640_EOK   : ����ATK-MC2640ģ�����õļĴ�����ɹ�
 *              ATK_MC2640_EINVAL: �����������
 */
static uint8_t atk_mc2640_reg_bank_select(atk_mc2640_reg_bank_t bank)
{
    switch (bank)
    {
        case ATK_MC2640_REG_BANK_DSP:
        {
            atk_mc2640_write_reg(ATK_MC2640_REG_BANK_SEL, 0x00);
            break;
        }
        case ATK_MC2640_REG_BANK_SENSOR:
        {
            atk_mc2640_write_reg(ATK_MC2640_REG_BANK_SEL, 0x01);
            break;
        }
        default:
        {
            return ATK_MC2640_EINVAL;
        }
    }
    
    return ATK_MC2640_EOK;
}

/**
 * @brief       ATK-MC2640ģ��Ӳ����ʼ��
 * @param       ��
 * @retval      ��
 */
static void atk_mc2640_hw_init(void)
{
    GPIO_InitTypeDef gpio_init_struct = {0};
    
    /* ʹ��GPIOʱ�� */
#if (ATK_MC2640_USING_DCMI == 0)
    ATK_MC2640_VSYNC_GPIO_CLK_ENABLE();
    ATK_MC2640_HREF_GPIO_CLK_ENABLE();
    ATK_MC2640_D0_GPIO_CLK_ENABLE();
    ATK_MC2640_D1_GPIO_CLK_ENABLE();
    ATK_MC2640_D2_GPIO_CLK_ENABLE();
    ATK_MC2640_D3_GPIO_CLK_ENABLE();
    ATK_MC2640_D4_GPIO_CLK_ENABLE();
    ATK_MC2640_D5_GPIO_CLK_ENABLE();
    ATK_MC2640_D6_GPIO_CLK_ENABLE();
    ATK_MC2640_D7_GPIO_CLK_ENABLE();
    ATK_MC2640_PCLK_GPIO_CLK_ENABLE();
#endif
    ATK_MC2640_RST_GPIO_CLK_ENABLE();
    ATK_MC2640_PWDN_GPIO_CLK_ENABLE();
    
#if (ATK_MC2640_USING_DCMI == 0)
    /* ��ʼ��VSYNC���� */
    gpio_init_struct.Pin    = ATK_MC2640_VSYNC_GPIO_PIN;
    gpio_init_struct.Mode   = GPIO_MODE_INPUT;
    gpio_init_struct.Pull   = GPIO_PULLUP;
    gpio_init_struct.Speed  = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(ATK_MC2640_VSYNC_GPIO_PORT, &gpio_init_struct);
    
    /* ��ʼ��HREF���� */
    gpio_init_struct.Pin    = ATK_MC2640_HREF_GPIO_PIN;
    gpio_init_struct.Mode   = GPIO_MODE_INPUT;
    gpio_init_struct.Pull   = GPIO_PULLUP;
    gpio_init_struct.Speed  = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(ATK_MC2640_HREF_GPIO_PORT, &gpio_init_struct);
    
    /* ��ʼ��D0���� */
    gpio_init_struct.Pin    = ATK_MC2640_D0_GPIO_PIN;
    gpio_init_struct.Mode   = GPIO_MODE_INPUT;
    gpio_init_struct.Pull   = GPIO_PULLUP;
    gpio_init_struct.Speed  = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(ATK_MC2640_D0_GPIO_PORT, &gpio_init_struct);
    
    /* ��ʼ��D1���� */
    gpio_init_struct.Pin    = ATK_MC2640_D1_GPIO_PIN;
    gpio_init_struct.Mode   = GPIO_MODE_INPUT;
    gpio_init_struct.Pull   = GPIO_PULLUP;
    gpio_init_struct.Speed  = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(ATK_MC2640_D1_GPIO_PORT, &gpio_init_struct);
    
    /* ��ʼ��D2���� */
    gpio_init_struct.Pin    = ATK_MC2640_D2_GPIO_PIN;
    gpio_init_struct.Mode   = GPIO_MODE_INPUT;
    gpio_init_struct.Pull   = GPIO_PULLUP;
    gpio_init_struct.Speed  = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(ATK_MC2640_D2_GPIO_PORT, &gpio_init_struct);
    
    /* ��ʼ��D3���� */
    gpio_init_struct.Pin    = ATK_MC2640_D3_GPIO_PIN;
    gpio_init_struct.Mode   = GPIO_MODE_INPUT;
    gpio_init_struct.Pull   = GPIO_PULLUP;
    gpio_init_struct.Speed  = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(ATK_MC2640_D3_GPIO_PORT, &gpio_init_struct);
    
    /* ��ʼ��D4���� */
    gpio_init_struct.Pin    = ATK_MC2640_D4_GPIO_PIN;
    gpio_init_struct.Mode   = GPIO_MODE_INPUT;
    gpio_init_struct.Pull   = GPIO_PULLUP;
    gpio_init_struct.Speed  = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(ATK_MC2640_D4_GPIO_PORT, &gpio_init_struct);
    
    /* ��ʼ��D5���� */
    gpio_init_struct.Pin    = ATK_MC2640_D5_GPIO_PIN;
    gpio_init_struct.Mode   = GPIO_MODE_INPUT;
    gpio_init_struct.Pull   = GPIO_PULLUP;
    gpio_init_struct.Speed  = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(ATK_MC2640_D5_GPIO_PORT, &gpio_init_struct);
    
    /* ��ʼ��D6���� */
    gpio_init_struct.Pin    = ATK_MC2640_D6_GPIO_PIN;
    gpio_init_struct.Mode   = GPIO_MODE_INPUT;
    gpio_init_struct.Pull   = GPIO_PULLUP;
    gpio_init_struct.Speed  = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(ATK_MC2640_D6_GPIO_PORT, &gpio_init_struct);
    
