rongshuxia/rt-thread_stm32f407/board/ATK_MC2640/atk_mc2640.c
    /* ��ʼ��D7���� */
    gpio_init_struct.Pin    = ATK_MC2640_D7_GPIO_PIN;
    gpio_init_struct.Mode   = GPIO_MODE_INPUT;
    gpio_init_struct.Pull   = GPIO_PULLUP;
    gpio_init_struct.Speed  = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(ATK_MC2640_D7_GPIO_PORT, &gpio_init_struct);
    
    /* ��ʼ��PCLK���� */
    gpio_init_struct.Pin    = ATK_MC2640_PCLK_GPIO_PIN;
    gpio_init_struct.Mode   = GPIO_MODE_INPUT;
    gpio_init_struct.Pull   = GPIO_PULLUP;
    gpio_init_struct.Speed  = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(ATK_MC2640_PCLK_GPIO_PORT, &gpio_init_struct);
#endif
    
    /* ��ʼ��RST���� */
    gpio_init_struct.Pin    = ATK_MC2640_RST_GPIO_PIN;
    gpio_init_struct.Mode   = GPIO_MODE_OUTPUT_PP;
    gpio_init_struct.Pull   = GPIO_PULLUP;
    gpio_init_struct.Speed  = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(ATK_MC2640_RST_GPIO_PORT, &gpio_init_struct);
    
    /* ��ʼ��PWDN���� */
    gpio_init_struct.Pin    = ATK_MC2640_PWDN_GPIO_PIN;//PD3
    gpio_init_struct.Mode   = GPIO_MODE_OUTPUT_PP;
    gpio_init_struct.Pull   = GPIO_PULLUP;
    gpio_init_struct.Speed  = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(ATK_MC2640_PWDN_GPIO_PORT, &gpio_init_struct);
    
#if (ATK_MC2640_LED_CTL_BY_OV2640 == 0)
    /* ��ʼ��FLASH���� */
    gpio_init_struct.Pin    = ATK_MC2640_FLASH_GPIO_PIN;
    gpio_init_struct.Mode   = GPIO_MODE_OUTPUT_PP;
    gpio_init_struct.Pull   = GPIO_PULLUP;
    gpio_init_struct.Speed  = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(ATK_MC2640_FLASH_GPIO_PORT, &gpio_init_struct);
#endif
    
    ATK_MC2640_RST(1);
    ATK_MC2640_PWDN(1);
#if (ATK_MC2640_LED_CTL_BY_OV2640 == 0)
    ATK_MC2640_FLASH(0);
#endif
}

/**
 * @brief       ATK-MC2640ģ���˳�����ģʽ
 * @param       ��
 * @retval      ��
 */
static void atk_mc2640_exit_power_down(void)
{
    ATK_MC2640_PWDN(0);
    stm32f4_delay_ms(10);
}

/**
 * @brief       ATK-MC2640ģ��Ӳ����λ
 * @param       ��
 * @retval      ��
 */
static void atk_mc2640_hw_reset(void)
{
    ATK_MC2640_RST(0);
    stm32f4_delay_ms(10);
    ATK_MC2640_RST(1);
    stm32f4_delay_ms(10);
}

/**
 * @brief       ATK-MC2640ģ��������λ
 * @param       ��
 * @retval      ��
 */
static void atk_mc2640_sw_reset(void)
{
    atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_SENSOR);
    atk_mc2640_write_reg(ATK_MC2640_REG_SENSOR_COM7, 0x80);
    stm32f4_delay_ms(50);
}

/**
 * @brief       ��ȡATK-MC2640ģ��������ID
 * @param       ��
 * @retval      ������ID
 */
static uint16_t atk_mc2640_get_mid(void)
{
    uint16_t mid;
    
    atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_SENSOR);
    mid = atk_mc2640_read_reg(ATK_MC2640_REG_SENSOR_MIDH) << 8;
    mid |= atk_mc2640_read_reg(ATK_MC2640_REG_SENSOR_MIDL);
    
    return mid;
}

/**
 * @brief       ��ȡATK-MC2640ģ���ƷID
 * @param       ��
 * @retval      ��ƷID
 */
static uint16_t atk_mc2640_get_pid(void)
{
    uint16_t pid;
    
    atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_SENSOR);
    pid = atk_mc2640_read_reg(ATK_MC2640_REG_SENSOR_PIDH) << 8;
    pid |= atk_mc2640_read_reg(ATK_MC2640_REG_SENSOR_PIDL);
    
    return pid;
}

/**
 * @brief       ��ʼ��ATK-MC2640�Ĵ�������
 * @param       ��
 * @retval      ��
 */
static void atk_mc2640_init_reg(void)
{
    uint32_t cfg_index;
    uint8_t zmow;
    uint8_t zmoh;
    uint8_t zmhh;
    
    for (cfg_index=0; cfg_index<(sizeof(atk_mc2640_init_uxga_cfg)/sizeof(atk_mc2640_init_uxga_cfg[0])); cfg_index++)
    {
        atk_mc2640_write_reg(atk_mc2640_init_uxga_cfg[cfg_index][0], atk_mc2640_init_uxga_cfg[cfg_index][1]);
    }
    
    atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
    zmow = atk_mc2640_read_reg(ATK_MC2640_REG_DSP_ZMOW);
    zmoh = atk_mc2640_read_reg(ATK_MC2640_REG_DSP_ZMOH);
    zmhh = atk_mc2640_read_reg(ATK_MC2640_REG_DSP_ZMHH);
    
    g_atk_mc2640_sta.output.width = ((uint16_t)zmow | ((zmhh & 0x03) << 8)) << 2;
    g_atk_mc2640_sta.output.height = ((uint16_t)zmoh | ((zmhh & 0x04) << 6)) << 2;
}

#if (ATK_MC2640_USING_DCMI == 0)
/**
 * @brief       ��ȡATK-MD2640�˿�D0~D7��һ�ֽ�����
 * @param       ��
 * @retval      ATK-MD2640�˿�D0~D7��һ�ֽ�����
 */
static inline uint8_t atk_mc2640_get_byte_data(void)
{
#if (ATK_MC2640_DATA_PIN_IN_SAME_GPIO_PORT == 0)
    uint8_t dat = 0;
    
    dat |= (((ATK_MC2640_D0_GPIO_PORT->IDR & ATK_MC2640_D0_GPIO_PIN) == 0) ? (0) : (1)) << 0;
    dat |= (((ATK_MC2640_D1_GPIO_PORT->IDR & ATK_MC2640_D1_GPIO_PIN) == 0) ? (0) : (1)) << 1;
    dat |= (((ATK_MC2640_D2_GPIO_PORT->IDR & ATK_MC2640_D2_GPIO_PIN) == 0) ? (0) : (1)) << 2;
    dat |= (((ATK_MC2640_D3_GPIO_PORT->IDR & ATK_MC2640_D3_GPIO_PIN) == 0) ? (0) : (1)) << 3;
    dat |= (((ATK_MC2640_D4_GPIO_PORT->IDR & ATK_MC2640_D4_GPIO_PIN) == 0) ? (0) : (1)) << 4;
    dat |= (((ATK_MC2640_D5_GPIO_PORT->IDR & ATK_MC2640_D5_GPIO_PIN) == 0) ? (0) : (1)) << 5;
    dat |= (((ATK_MC2640_D6_GPIO_PORT->IDR & ATK_MC2640_D6_GPIO_PIN) == 0) ? (0) : (1)) << 6;
    dat |= (((ATK_MC2640_D7_GPIO_PORT->IDR & ATK_MC2640_D7_GPIO_PIN) == 0) ? (0) : (1)) << 7;
    
    return dat;
#else
    return ATK_MC2640_DATE_GPIO_PORT->IDR & ATK_MC2640_DATA_READ_MASK;
#endif
}
#endif

#if (ATK_MC2640_USING_DCMI == 0)
/**
 * @brief       ��ʼ��ATK-MC2640ģ��DMA
 * @param       meminc          : DMA_MINC_DISABLE: ֡���ݽ��յ�Ŀ�ĵ�ַ�Զ�����
 *                                DMA_MINC_ENABLE : ֡���ݽ��յ�Ŀ�ĵ�ַ���Զ�����
 *              memdataalignment: DMA_MDATAALIGN_BYTE    : ֡���ݽ��ջ����λ��Ϊ8����
 *                                DMA_MDATAALIGN_HALFWORD: ֡���ݽ��ջ����λ��Ϊ16����
 *                                DMA_MDATAALIGN_WORD    : ֡���ݽ��ջ����λ��Ϊ32����
 * @retval      ��
 */
static void atk_mc2640_dma_init(uint32_t meminc, uint32_t memdataalignment)
{
    ATK_MC2640_DMA_CLK_ENABLE();
    
    g_atk_mc2640_sta.read.dma_handle.Instance                 = ATK_MC2640_DMA_INTERFACE;
    g_atk_mc2640_sta.read.dma_handle.Init.Channel             = ATK_MC2640_DMA_CHANNEL;
    g_atk_mc2640_sta.read.dma_handle.Init.Direction           = DMA_MEMORY_TO_MEMORY;
    g_atk_mc2640_sta.read.dma_handle.Init.PeriphInc           = DMA_PINC_ENABLE;
    g_atk_mc2640_sta.read.dma_handle.Init.MemInc              = meminc;
    g_atk_mc2640_sta.read.dma_handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    g_atk_mc2640_sta.read.dma_handle.Init.MemDataAlignment    = memdataalignment;
    g_atk_mc2640_sta.read.dma_handle.Init.Mode                = DMA_NORMAL;
    g_atk_mc2640_sta.read.dma_handle.Init.Priority            = DMA_PRIORITY_VERY_HIGH;
    
    HAL_DMA_Init(&g_atk_mc2640_sta.read.dma_handle);
}
#endif

/**
 * @brief       ��ʼ��ATK-MC2640ģ��
 * @param       ��
 * @retval      ATK_MC2640_EOK   : ATK-MC2640ģ���ʼ���ɹ�
 *              ATK_MC2640_ERROR : ͨѶ������ATK-MC2640ģ���ʼ��ʧ��
 *              ATK_MC2640_ENOMEM: �ڴ治�㣬ATK-MC2640ģ���ʼ��ʧ��
 */
uint8_t atk_mc2640_init(void)
{
    uint16_t mid;
    uint16_t pid;
    
    atk_mc2640_hw_init();           /* ATK-MC2640ģ��Ӳ����ʼ�� */
    atk_mc2640_exit_power_down();   /* ATK-MC2640ģ���˳�����ģʽ */
    atk_mc2640_hw_reset();          /* ATK-MC2640ģ��Ӳ����λ */
    atk_mc2640_sccb_init();         /* ATK-MC2640 SCCB�ӿڳ�ʼ�� */
    atk_mc2640_sw_reset();          /* ATK-MC2640ģ��������λ */
    
