rongshuxia/rt-thread_stm32f407/board/ATK_MC2640/atk_mc2640.c
    mid = atk_mc2640_get_mid();     /* ��ȡ������ID */
    if (mid != ATK_MC2640_MID)
    {
        return ATK_MC2640_ERROR;
    }
    
    pid = atk_mc2640_get_pid();     /* ��ȡ��ƷID */
    if (pid != ATK_MC2640_PID)
    {
        return ATK_MC2640_ERROR;
    }
    
    atk_mc2640_init_reg();          /* ��ʼ��ATK-MC2640�Ĵ������� */
    
#if (ATK_MC2640_USING_DCMI == 0)
    g_atk_mc2640_sta.read.line_buf = mymalloc(SRAMIN, g_atk_mc2640_sta.output.width * sizeof(uint16_t));
    
    if (g_atk_mc2640_sta.read.line_buf == NULL)
    {
        return ATK_MC2640_ENOMEM;
    }
#endif
    
#if (ATK_MC2640_USING_DCMI != 0)
    atk_mc2640_dcmi_init();         /* ��ʼ��ATK-MC2640ģ��DCMI�ӿ� */
#endif
    
    return ATK_MC2640_EOK;
}

#if (ATK_MC2640_LED_CTL_BY_OV2640 == 0)
/**
 * @brief       ����ATK-MC2640ģ�������
 * @param       ��
 * @retval      ��
 */
void atk_mc2640_led_on(void)
{
    ATK_MC2640_FLASH(1);
}

/**
 * @brief       �ر�ATK-MC2640ģ�������
 * @param       ��
 * @retval      ��
 */
void atk_mc2640_led_off(void)
{
    ATK_MC2640_FLASH(0);
}
#else
/**
 * @brief       ��˸ATK-MC2640ģ�����LED
 * @param       ��
 * @retval      ��
 */
void atk_mc2640_led_enable(void)
{
    atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_SENSOR);
    atk_mc2640_write_reg(ATK_MC2640_REG_SENSOR_COM22, 0x81);
    atk_mc2640_write_reg(ATK_MC2640_REG_SENSOR_COM22, 0x01);
}
#endif

/**
 * @brief       ����ATK-MC2640ģ��ƹ�ģʽ
 * @param       mode: ATK_MC2640_LIGHT_MOED_AUTO  : Auto
 *                    ATK_MC2640_LIGHT_MOED_SUNNY : Sunny
 *                    ATK_MC2640_LIGHT_MOED_CLOUDY: Cloudy
 *                    ATK_MC2640_LIGHT_MOED_OFFICE: Office
 *                    ATK_MC2640_LIGHT_MOED_HOME  : Home
 * @retval      ATK_MC2640_EOK   : ����ATK-MC2640ģ��ƹ�ģʽ�ɹ�
 *              ATK_MC2640_EINVAL: �����������
 */
uint8_t atk_mc2640_set_light_mode(atk_mc2640_light_mode_t mode)
{
    switch (mode)
    {
        case ATK_MC2640_LIGHT_MODE_AUTO:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0xC7, 0x00);
            break;
        }
        case ATK_MC2640_LIGHT_MODE_SUNNY:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0xC7, 0x40);
            atk_mc2640_write_reg(0xCC, 0x5E);
            atk_mc2640_write_reg(0xCD, 0x41);
            atk_mc2640_write_reg(0xCE, 0x54);
            break;
        }
        case ATK_MC2640_LIGHT_MODE_CLOUDY:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0xC7, 0x40);
            atk_mc2640_write_reg(0xCC, 0x65);
            atk_mc2640_write_reg(0xCD, 0x41);
            atk_mc2640_write_reg(0xCE, 0x4F);
            break;
        }
        case ATK_MC2640_LIGHT_MODE_OFFICE:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0xC7, 0x40);
            atk_mc2640_write_reg(0xCC, 0x52);
            atk_mc2640_write_reg(0xCD, 0x41);
            atk_mc2640_write_reg(0xCE, 0x66);
            break;
        }
        case ATK_MC2640_LIGHT_MODE_HOME:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0xC7, 0x40);
            atk_mc2640_write_reg(0xCC, 0x42);
            atk_mc2640_write_reg(0xCD, 0x3F);
            atk_mc2640_write_reg(0xCE, 0x71);
            break;
        }
        default:
        {
            return ATK_MC2640_EINVAL;
        }
    }
    
    return ATK_MC2640_EOK;
}

/**
 * @brief       ����ATK-MC2640ģ��ɫ�ʱ��Ͷ�
 * @param       saturation: ATK_MC2640_COLOR_SATURATION_0: +2
 *                          ATK_MC2640_COLOR_SATURATION_1: +1
 *                          ATK_MC2640_COLOR_SATURATION_2: 0
 *                          ATK_MC2640_COLOR_SATURATION_3: -1
 *                          ATK_MC2640_COLOR_SATURATION_4: -2
 * @retval      ATK_MC2640_EOK   : ����ATK-MC2640ģ��ɫ�ʱ��Ͷȳɹ�
 *              ATK_MC2640_EINVAL: �����������
 */
uint8_t atk_mc2640_set_color_saturation(atk_mc2640_color_saturation_t saturation)
{
    switch (saturation)
    {
        case ATK_MC2640_COLOR_SATURATION_0:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x02);
            atk_mc2640_write_reg(0x7C, 0x03);
            atk_mc2640_write_reg(0x7D, 0x68);
            atk_mc2640_write_reg(0x7D, 0x68);
            break;
        }
        case ATK_MC2640_COLOR_SATURATION_1:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x02);
            atk_mc2640_write_reg(0x7C, 0x03);
            atk_mc2640_write_reg(0x7D, 0x58);
            atk_mc2640_write_reg(0x7D, 0x58);
            break;
        }
        case ATK_MC2640_COLOR_SATURATION_2:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x02);
            atk_mc2640_write_reg(0x7C, 0x03);
            atk_mc2640_write_reg(0x7D, 0x48);
            atk_mc2640_write_reg(0x7D, 0x48);
            break;
        }
        case ATK_MC2640_COLOR_SATURATION_3:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x02);
            atk_mc2640_write_reg(0x7C, 0x03);
            atk_mc2640_write_reg(0x7D, 0x38);
            atk_mc2640_write_reg(0x7D, 0x38);
            break;
        }
        case ATK_MC2640_COLOR_SATURATION_4:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x02);
            atk_mc2640_write_reg(0x7C, 0x03);
            atk_mc2640_write_reg(0x7D, 0x28);
            atk_mc2640_write_reg(0x7D, 0x28);
            break;
        }
        default:
        {
            return ATK_MC2640_EINVAL;
        }
    }
    
    return ATK_MC2640_EOK;
}

/**
 * @brief       ����ATK-MC2640ģ������
 * @param       brightness: ATK_MC2640_BRIGHTNESS_0: +2
 *                          ATK_MC2640_BRIGHTNESS_1: +1
 *                          ATK_MC2640_BRIGHTNESS_2: 0
 *                          ATK_MC2640_BRIGHTNESS_3: -1
 *                          ATK_MC2640_BRIGHTNESS_4: -2
 * @retval      ATK_MC2640_EOK   : ����ATK-MC2640ģ�����ȳɹ�
 *              ATK_MC2640_EINVAL: �����������
 */
uint8_t atk_mc2640_set_brightness(atk_mc2640_brightness_t brightness)
{
    switch (brightness)
    {
        case ATK_MC2640_BRIGHTNESS_0:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x04);
            atk_mc2640_write_reg(0x7C, 0x09);
            atk_mc2640_write_reg(0x7D, 0x40);
            atk_mc2640_write_reg(0x7D, 0x00);
            break;
        }
        case ATK_MC2640_BRIGHTNESS_1:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x04);
            atk_mc2640_write_reg(0x7C, 0x09);
            atk_mc2640_write_reg(0x7D, 0x30);
            atk_mc2640_write_reg(0x7D, 0x00);
            break;
        }
        case ATK_MC2640_BRIGHTNESS_2:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x04);
            atk_mc2640_write_reg(0x7C, 0x09);
            atk_mc2640_write_reg(0x7D, 0x20);
            atk_mc2640_write_reg(0x7D, 0x00);
            break;
        }
        case ATK_MC2640_BRIGHTNESS_3:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x04);
            atk_mc2640_write_reg(0x7C, 0x09);
            atk_mc2640_write_reg(0x7D, 0x10);
            atk_mc2640_write_reg(0x7D, 0x00);
            break;
        }
        case ATK_MC2640_BRIGHTNESS_4:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x04);
            atk_mc2640_write_reg(0x7C, 0x09);
            atk_mc2640_write_reg(0x7D, 0x00);
            atk_mc2640_write_reg(0x7D, 0x00);
            break;
        }
        default:
        {
            return ATK_MC2640_EINVAL;
        }
    }
    
    return ATK_MC2640_EOK;
}

/**
 * @brief       ����ATK-MC2640ģ��Աȶ�
 * @param       contrast: ATK_MC2640_CONTRAST_0: +2
 *                        ATK_MC2640_CONTRAST_1: +1
 *                        ATK_MC2640_CONTRAST_2: 0
 *                        ATK_MC2640_CONTRAST_3: -1
 *                        ATK_MC2640_CONTRAST_4: -2
 * @retval      ATK_MC2640_EOK   : ����ATK-MC2640ģ��Աȶȳɹ�
 *              ATK_MC2640_EINVAL: �����������
 */
uint8_t atk_mc2640_set_contrast(atk_mc2640_contrast_t contrast)
{
    switch (contrast)
    {
        case ATK_MC2640_CONTRAST_0:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x04);
            atk_mc2640_write_reg(0x7C, 0x07);
            atk_mc2640_write_reg(0x7D, 0x20);
            atk_mc2640_write_reg(0x7D, 0x28);
            atk_mc2640_write_reg(0x7D, 0x0C);
            atk_mc2640_write_reg(0x7D, 0x06);
            break;
        }
        case ATK_MC2640_CONTRAST_1:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x04);
            atk_mc2640_write_reg(0x7C, 0x07);
            atk_mc2640_write_reg(0x7D, 0x20);
            atk_mc2640_write_reg(0x7D, 0x24);
            atk_mc2640_write_reg(0x7D, 0x16);
            atk_mc2640_write_reg(0x7D, 0x06);
            break;
        }
        case ATK_MC2640_CONTRAST_2:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x04);
            atk_mc2640_write_reg(0x7C, 0x07);
            atk_mc2640_write_reg(0x7D, 0x20);
            atk_mc2640_write_reg(0x7D, 0x20);
            atk_mc2640_write_reg(0x7D, 0x20);
            atk_mc2640_write_reg(0x7D, 0x06);
            break;
        }
        case ATK_MC2640_CONTRAST_3:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x04);
            atk_mc2640_write_reg(0x7C, 0x07);
            atk_mc2640_write_reg(0x7D, 0x20);
            atk_mc2640_write_reg(0x7D, 0x1C);
            atk_mc2640_write_reg(0x7D, 0x2A);
            atk_mc2640_write_reg(0x7D, 0x06);
            break;
        }
        case ATK_MC2640_CONTRAST_4:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x04);
            atk_mc2640_write_reg(0x7C, 0x07);
            atk_mc2640_write_reg(0x7D, 0x20);
            atk_mc2640_write_reg(0x7D, 0x18);
            atk_mc2640_write_reg(0x7D, 0x34);
            atk_mc2640_write_reg(0x7D, 0x06);
            break;
        }
        default:
        {
            return ATK_MC2640_EINVAL;
        }
    }
    
    return ATK_MC2640_EOK;
}


/**
 * @brief       ����ATK-MC2640ģ������Ч��
 * @param       contrast: ATK_MC2640_SPECIAL_EFFECT_ANTIQUE    : Antique
 *                        ATK_MC2640_SPECIAL_EFFECT_BLUISH     : Bluish
 *                        ATK_MC2640_SPECIAL_EFFECT_GREENISH   : Greenish
 *                        ATK_MC2640_SPECIAL_EFFECT_REDISH     : Redish
 *                        ATK_MC2640_SPECIAL_EFFECT_BW         : B&W
 *                        ATK_MC2640_SPECIAL_EFFECT_NEGATIVE   : Negative
 *                        ATK_MC2640_SPECIAL_EFFECT_BW_NEGATIVE: B&W Negative
 *                        ATK_MC2640_SPECIAL_EFFECT_NORMAL     : Normal
 * @retval      ATK_MC2640_EOK   : ����ATK-MC2640ģ������Ч���ɹ�
 *              ATK_MC2640_EINVAL: �����������
 */
uint8_t atk_mc2640_set_special_effect(atk_mc2640_special_effect_t effect)
{
    switch (effect)
    {
        case ATK_MC2640_SPECIAL_EFFECT_ANTIQUE:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x18);
            atk_mc2640_write_reg(0x7C, 0x05);
            atk_mc2640_write_reg(0x7D, 0x40);
            atk_mc2640_write_reg(0x7D, 0xA6);
            break;
        }
        case ATK_MC2640_SPECIAL_EFFECT_BLUISH:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x18);
            atk_mc2640_write_reg(0x7C, 0x05);
            atk_mc2640_write_reg(0x7D, 0xA0);
            atk_mc2640_write_reg(0x7D, 0x40);
            break;
        }
        case ATK_MC2640_SPECIAL_EFFECT_GREENISH:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x18);
            atk_mc2640_write_reg(0x7C, 0x05);
            atk_mc2640_write_reg(0x7D, 0x40);
            atk_mc2640_write_reg(0x7D, 0x40);
            break;
        }
        case ATK_MC2640_SPECIAL_EFFECT_REDISH:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x18);
            atk_mc2640_write_reg(0x7C, 0x05);
            atk_mc2640_write_reg(0x7D, 0x40);
            atk_mc2640_write_reg(0x7D, 0xC0);
            break;
        }
        case ATK_MC2640_SPECIAL_EFFECT_BW:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x18);
            atk_mc2640_write_reg(0x7C, 0x05);
            atk_mc2640_write_reg(0x7D, 0x80);
            atk_mc2640_write_reg(0x7D, 0x80);
            break;
        }
        case ATK_MC2640_SPECIAL_EFFECT_NEGATIVE:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x40);
            atk_mc2640_write_reg(0x7C, 0x05);
            atk_mc2640_write_reg(0x7D, 0x80);
            atk_mc2640_write_reg(0x7D, 0x80);
            break;
        }
        case ATK_MC2640_SPECIAL_EFFECT_BW_NEGATIVE:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x58);
            atk_mc2640_write_reg(0x7C, 0x05);
            atk_mc2640_write_reg(0x7D, 0x80);
            atk_mc2640_write_reg(0x7D, 0x80);
            break;
        }
        case ATK_MC2640_SPECIAL_EFFECT_NORMAL:
        {
            atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
            atk_mc2640_write_reg(0x7C, 0x00);
            atk_mc2640_write_reg(0x7D, 0x00);
            atk_mc2640_write_reg(0x7C, 0x05);
            atk_mc2640_write_reg(0x7D, 0x80);
            atk_mc2640_write_reg(0x7D, 0x80);
            break;
        }
        default:
        {
            return ATK_MC2640_EINVAL;
        }
    }
    
    return ATK_MC2640_EOK;
}

/**
 * @brief       ����ATK-MC2640ģ�����ͼ���ʽ
 * @param       mode: ATK_MC2640_OUTPUT_FORMAT_RGB565: RGB565
 *                    ATK_MC2640_OUTPUT_FORMAT_JPEG : JPEG
 * @retval      ATK_MC2640_EOK   : ����ATK-MC2640ģ�����ͼ���ʽ�ɹ�
 *              ATK_MC2640_EINVAL: �����������
 */
uint8_t atk_mc2640_set_output_format(atk_mc2640_output_format_t format)
{
    uint32_t cfg_index;
    
    switch (format)
    {
        case ATK_MC2640_OUTPUT_FORMAT_RGB565:
        {
            for (cfg_index=0; cfg_index<(sizeof(atk_mc2640_set_rgb565_cfg)/sizeof(atk_mc2640_set_rgb565_cfg[0])); cfg_index++)
            {
                atk_mc2640_write_reg(atk_mc2640_set_rgb565_cfg[cfg_index][0], atk_mc2640_set_rgb565_cfg[cfg_index][1]);
            }
            break;
        }
        case ATK_MC2640_OUTPUT_FORMAT_JPEG:
        {
            for (cfg_index=0; cfg_index<(sizeof(atk_mc2640_set_yuv422_cfg)/sizeof(atk_mc2640_set_yuv422_cfg[0])); cfg_index++)
            {
                atk_mc2640_write_reg(atk_mc2640_set_yuv422_cfg[cfg_index][0], atk_mc2640_set_yuv422_cfg[cfg_index][1]);
            }
            for (cfg_index=0; cfg_index<(sizeof(atk_mc2640_set_jpeg_cfg)/sizeof(atk_mc2640_set_jpeg_cfg[0])); cfg_index++)
            {
                atk_mc2640_write_reg(atk_mc2640_set_jpeg_cfg[cfg_index][0], atk_mc2640_set_jpeg_cfg[cfg_index][1]);
            }
            break;
        }
        default:
        {
            return ATK_MC2640_EINVAL;
        }
    }
    
    return ATK_MC2640_EOK;
}

/**
 * @brief       ����ATK-MC2640ģ�����ͼ��ֱ���
 * @param       width : ���ͼ����ȣ�������4�ı���
 *              height: ���ͼ��߶ȣ�������4�ı���
 * @retval      ATK_MC2640_EOK   : ����ATK-MC2640ģ�����ͼ���С�ɹ�
 *              ATK_MC2640_EINVAL: �����������
 *              ATK_MC2640_ENOMEM: �ڴ治��
 */
uint8_t atk_mc2640_set_output_size(uint16_t width, uint16_t height)
{
    uint16_t output_width;
    uint16_t output_height;
    
    if (((width & (4 - 1)) != 0) || ((height & (4 - 1)) != 0))
    {
        return ATK_MC2640_EINVAL;
    }
    
#if (ATK_MC2640_USING_DCMI == 0)
    myfree(SRAMIN, g_atk_mc2640_sta.read.line_buf);
    g_atk_mc2640_sta.read.line_buf = mymalloc(SRAMIN, width * sizeof(uint16_t));
    if (g_atk_mc2640_sta.read.line_buf == NULL)
    {
        g_atk_mc2640_sta.read.line_buf = mymalloc(SRAMIN, g_atk_mc2640_sta.output.width * sizeof(uint16_t));
        return ATK_MC2640_ENOMEM;
    }
    else
#endif
    {
        g_atk_mc2640_sta.output.width = width;
        g_atk_mc2640_sta.output.height = height;
    }
    
    output_width = width >> 2;
    output_height = height >> 2;
    
    atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_RESET, 0x04);
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_ZMOW, (uint8_t)(output_width & 0x00FF));
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_ZMOH, (uint8_t)(output_height & 0x00FF));
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_ZMHH, ((uint8_t)(output_width >> 8) & 0x03) | ((uint8_t)(output_height >> 6) & 0x04));
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_RESET, 0x00);
    
    return ATK_MC2640_EOK;
}

/**
 * @brief       ����ATK-MC2640ģ�鴫��������
 * @param       start_x: ������������ʼX����
 *              start_y: ������������ʼY����
 *              width  : ���������ڿ���
 *              height : ���������ڸ߶�
 * @retval      ��
 */
void atk_mc2640_set_sensor_window(uint16_t start_x, uint16_t start_y, uint16_t width, uint16_t height)
{
    uint16_t end_x;
    uint16_t end_y;
    uint8_t raw_com1;
    uint8_t com1;
    uint8_t raw_reg32;
    uint8_t reg32;
    
    end_x = start_x + (width >> 1);
    end_y = start_y + (height >> 1);
    
    atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_SENSOR);
    
    raw_com1 = atk_mc2640_read_reg(ATK_MC2640_REG_SENSOR_COM1);
    com1 = (raw_com1 & 0xF0) | (((end_y & 0x03) << 2) | (start_y & 0x03));
    atk_mc2640_write_reg(ATK_MC2640_REG_SENSOR_COM1, com1);
    atk_mc2640_write_reg(ATK_MC2640_REG_SENSOR_VSTRT, start_y >> 2);
    atk_mc2640_write_reg(ATK_MC2640_REG_SENSOR_VEND, end_y >> 2);
    
    raw_reg32 = atk_mc2640_read_reg(ATK_MC2640_REG_SENSOR_REG32);
    reg32 = (raw_reg32 & 0xC0) | (((end_x & 0x07) << 3) | (start_x & 0x07));
    atk_mc2640_write_reg(ATK_MC2640_REG_SENSOR_REG32, reg32);
    atk_mc2640_write_reg(ATK_MC2640_REG_SENSOR_HREFST, start_x >> 3);
    atk_mc2640_write_reg(ATK_MC2640_REG_SENSOR_HREFEND, end_x >> 3);
}

/**
 * @brief       ����ATK-MC2640ģ�����ͼ�񴰿�
 * @param       off_x : ���ͼ�񴰿�ƫ��X����
 *              off_y : ���ͼ�񴰿�ƫ��Y����
 *              width : ���ͼ�񴰿ڿ��ȣ�������4�ı���
 *              height: ���ͼ�񴰿ڸ߶ȣ�������4�ı���
 * @retval      ATK_MC2640_EOK   : ����ATK-MC2640ģ�����ͼ���С�ɹ�
 *              ATK_MC2640_EINVAL: �����������
 */
uint8_t atk_mc2640_set_image_window(uint16_t off_x, uint16_t off_y, uint16_t width, uint16_t height)
{
    uint16_t hsize;
    uint16_t vsize;
    uint8_t vhyx;
    
    if (((width & (4 - 1)) != 0) || ((height & (4 - 1)) != 0))
    {
        return ATK_MC2640_EINVAL;
    }
    
    hsize = width >> 2;
    vsize = height >> 2;
    
    vhyx = (uint8_t)(((vsize >> 1) & 0x80) | ((off_y >> 4) & 0x70) | ((hsize >> 5) & 0x08) | ((off_x >> 8) & 0x07));
    
    atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_RESET, 0x04);
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_HSIZE, (uint8_t)(hsize & 0x00FF));
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_VSIZE, (uint8_t)(vsize & 0x00FF));
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_XOFFL, (uint8_t)(off_x & 0x00FF));
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_YOFFL, (uint8_t)(off_y & 0x00FF));
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_VHYX, vhyx);
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_TEST, (uint8_t)((hsize >> 2) & 0x80));
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_RESET, 0x00);
    
    return ATK_MC2640_EOK;
}

/**
 * @brief       ����ATK-MC2640ģ�����ͼ���С
 * @param       off_x : ���ͼ�񴰿�ƫ��X����
 *              off_y : ���ͼ�񴰿�ƫ��Y����
 *              width : ���ͼ�񴰿ڿ��ȣ�������4�ı���
 *              height: ���ͼ�񴰿ڸ߶ȣ�������4�ı���
 * @retval      ATK_MC2640_EOK   : ����ATK-MC2640ģ�����ͼ���С�ɹ�
 *              ATK_MC2640_EINVAL: �����������
 */
void atk_mc2640_set_image_size(uint16_t width, uint16_t height)
{
    uint8_t sizel;
    
    sizel = (uint8_t)(((width & 0x07) << 3) | (height & 0x07) | ((width >> 4) & 0x80));
    
    atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_RESET, 0x04);
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_HSIZE8, (uint8_t)((width >> 3) & 0x00FF));
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_VSIZE8, (uint8_t)((height >> 3) & 0x00FF));
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_SIZEL, sizel);
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_RESET, 0x00);
}

/**
 * @brief       ����ATK-MC2640ģ���������
 * @param       clk_dev : Clock divider��0~63��
 *              pclk_dev: DVP PCLK��1~127��
 * @retval      ATK_MC2640_EOK   : ����ATK-MC2640ģ��������ʳɹ�
 *              ATK_MC2640_EINVAL: �����������
 */
uint8_t atk_mc2640_set_output_speed(uint8_t clk_dev, uint8_t pclk_dev)
{
    if (clk_dev > 63)
    {
        return ATK_MC2640_EINVAL;
    }
    
    if ((pclk_dev == 0) || (pclk_dev > 127))
    {
        return ATK_MC2640_EINVAL;
    }
    
    atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_DSP);
    atk_mc2640_write_reg(ATK_MC2640_REG_DSP_R_DVP_SP, pclk_dev);
    atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_SENSOR);
    atk_mc2640_write_reg(ATK_MC2640_REG_SENSOR_CLKRC, clk_dev);
    
    return ATK_MC2640_EOK;
}

/**
 * @brief       ����ATK-MC2640ģ���������
 * @param       ��
 * @retval      ��
 */
void atk_mc2640_colorbar_enable(void)
{
    uint8_t com7;
    
    atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_SENSOR);
    com7 = atk_mc2640_read_reg(ATK_MC2640_REG_SENSOR_COM7);
    com7 |= (uint8_t)(1 << 1);
    atk_mc2640_write_reg(ATK_MC2640_REG_SENSOR_COM7, com7);
}

/**
 * @brief       �ر�ATK-MC2640ģ���������
 * @param       ��
 * @retval      ��
 */
void atk_mc2640_colorbar_disable(void)
{
    uint8_t com7;
    
    atk_mc2640_reg_bank_select(ATK_MC2640_REG_BANK_SENSOR);
    com7 = atk_mc2640_read_reg(ATK_MC2640_REG_SENSOR_COM7);
    com7 &= ~(uint8_t)(1 << 1);
    atk_mc2640_write_reg(ATK_MC2640_REG_SENSOR_COM7, com7);
}

