rongshuxia/rt-thread_stm32f407/board/ATK_MC2640/atk_mc2640.c
/**
 * @brief       ��ȡATK-MC2640ģ�������һ֡ͼ������
 * @param       dts_addr : ֡���ݵĽ��ջ�����׵�ַ
 *              type: ATK_MC2640_GET_TYPE_DTS_8B_NOINC : ͼ���������ֽڷ�ʽд��Ŀ�ĵ�ַ��Ŀ�ĵ�ַ�̶�����
 *                    ATK_MC2640_GET_TYPE_DTS_8B_INC   : ͼ���������ֽڷ�ʽд��Ŀ�ĵ�ַ��Ŀ�ĵ�ַ�Զ�����
 *                    ATK_MC2640_GET_TYPE_DTS_16B_NOINC: ͼ�������԰��ַ�ʽд��Ŀ�ĵ�ַ��Ŀ�ĵ�ַ�̶�����
 *                    ATK_MC2640_GET_TYPE_DTS_16B_INC  : ͼ�������԰��ַ�ʽд��Ŀ�ĵ�ַ��Ŀ�ĵ�ַ�Զ�����
 *                    ATK_MC2640_GET_TYPE_DTS_32B_NOINC: ͼ���������ַ�ʽд��Ŀ�ĵ�ַ��Ŀ�ĵ�ַ�̶�����
 *                    ATK_MC2640_GET_TYPE_DTS_32B_INC  : ͼ���������ַ�ʽд��Ŀ�ĵ�ַ��Ŀ�ĵ�ַ�Զ�����
 *              before_transfer: ֡���ݴ���ǰ����Ҫ��ɵ����񣬿�ΪNULL
 * @retval      ATK_MC2640_EOK   : ��ȡATK-MC2640ģ�������һ֡ͼ�����ݳɹ�
 *              ATK_MC2640_EINVAL: �����������
 *              ATK_MC2640_EEMPTY: ͼ������Ϊ��
 */
uint8_t atk_mc2640_get_frame(uint32_t dts_addr, atk_mc2640_get_type_t type, void (*before_transfer)(void))
{
    return atk_mc2640_get_frame_sized(dts_addr, type, before_transfer, 0);
}

uint8_t atk_mc2640_get_frame_sized(uint32_t dts_addr, atk_mc2640_get_type_t type, void (*before_transfer)(void), uint32_t buf_bytes)
{
    uint32_t meminc;
    uint32_t memdataalignment;
#if (ATK_MC2640_USING_DCMI != 0)
    uint32_t len;
#else
    uint16_t pixel_cnt = 0;
    uint16_t line_cnt = 0;
    uint16_t dts_offset;
#endif
    
    switch (type)
    {
        case ATK_MC2640_GET_TYPE_DTS_8B_NOINC:
        {
            meminc = DMA_MINC_DISABLE;
            memdataalignment = DMA_MDATAALIGN_BYTE;
#if (ATK_MC2640_USING_DCMI != 0)
            len = (g_atk_mc2640_sta.output.width * g_atk_mc2640_sta.output.height) / sizeof(uint8_t);
#else
            dts_offset = 0;
#endif
            break;
        }
        case ATK_MC2640_GET_TYPE_DTS_8B_INC:
        {
            meminc = DMA_MINC_ENABLE;
            memdataalignment = DMA_MDATAALIGN_BYTE;
#if (ATK_MC2640_USING_DCMI != 0)
            len = (g_atk_mc2640_sta.output.width * g_atk_mc2640_sta.output.height) / sizeof(uint8_t);
#else
            dts_offset = g_atk_mc2640_sta.output.width << 1;
#endif
            break;
        }
        case ATK_MC2640_GET_TYPE_DTS_16B_NOINC:
        {
            meminc = DMA_MINC_DISABLE;
            memdataalignment = DMA_MDATAALIGN_HALFWORD;
#if (ATK_MC2640_USING_DCMI != 0)
            len = (g_atk_mc2640_sta.output.width * g_atk_mc2640_sta.output.height) / sizeof(uint16_t);
					
#else
            dts_offset = 0;
#endif
            break;
        }
        case ATK_MC2640_GET_TYPE_DTS_16B_INC:
        {
            meminc = DMA_MINC_ENABLE;
            memdataalignment = DMA_MDATAALIGN_HALFWORD;
#if (ATK_MC2640_USING_DCMI != 0)
            len = (g_atk_mc2640_sta.output.width * g_atk_mc2640_sta.output.height) / sizeof(uint16_t);
#else
            dts_offset = g_atk_mc2640_sta.output.width << 1;
#endif
            break;
        }
        case ATK_MC2640_GET_TYPE_DTS_32B_NOINC:
        {
            meminc = DMA_MINC_DISABLE;
            memdataalignment = DMA_MDATAALIGN_WORD;
#if (ATK_MC2640_USING_DCMI != 0)
            len = (g_atk_mc2640_sta.output.width * g_atk_mc2640_sta.output.height) / sizeof(uint32_t);
#else
            dts_offset = 0;
#endif
            break;
        }
        case ATK_MC2640_GET_TYPE_DTS_32B_INC:
        {
            meminc = DMA_MINC_ENABLE;
            memdataalignment = DMA_MDATAALIGN_WORD;
#if (ATK_MC2640_USING_DCMI != 0)
            len = (g_atk_mc2640_sta.output.width * g_atk_mc2640_sta.output.height) / sizeof(uint32_t);
#else
            dts_offset = g_atk_mc2640_sta.output.width << 1;
#endif
            break;
        }
        default:
        {
            return ATK_MC2640_EINVAL;
        }
    }
    
    
#if (ATK_MC2640_USING_DCMI != 0)
    if (before_transfer != NULL)
    {
        before_transfer();
    }

    if (buf_bytes >= sizeof(uint32_t))
    {
        uint32_t max_words = buf_bytes / sizeof(uint32_t);

        if (len > max_words)
        {
            len = max_words;
        }
    }

    if (atk_mc2640_dcmi_start(dts_addr, meminc, memdataalignment, len) != 0)
    {
        return ATK_MC2640_EEMPTY;
    }
#else
    atk_mc2640_dma_init(meminc, memdataalignment);
    
    if (ATK_MC2640_READ_VSYNC() != 0)
    {
        return ATK_MC2640_EEMPTY;
    }
    
    if (before_transfer != NULL)
    {
        before_transfer();
    }
    
    while (line_cnt < g_atk_mc2640_sta.output.height)
    {
        while (ATK_MC2640_READ_HREF() != 0)
        {
            while (ATK_MC2640_READ_PCLK() == 0);
            g_atk_mc2640_sta.read.line_buf[pixel_cnt++] = atk_mc2640_get_byte_data();
            while (ATK_MC2640_READ_PCLK() != 0);
            while (ATK_MC2640_READ_PCLK() == 0);
            g_atk_mc2640_sta.read.line_buf[pixel_cnt++] = atk_mc2640_get_byte_data();
            while (ATK_MC2640_READ_PCLK() != 0);
        }
        
        if (pixel_cnt != 0)
        {
            HAL_DMA_Abort(&g_atk_mc2640_sta.read.dma_handle);
            HAL_DMA_Start(&g_atk_mc2640_sta.read.dma_handle, (uint32_t)g_atk_mc2640_sta.read.line_buf, dts_addr, g_atk_mc2640_sta.output.width);
            dts_addr += dts_offset;
            pixel_cnt = 0;
            line_cnt++;
        }
    }
#endif
    
    return ATK_MC2640_EOK;
}

